#include	<reg51.h>
/*宣告驅動信號陣列*/
char code TAB[10]={	0xc0, 0xf9, 0xa4, 0xb0, 0x99,
					0x92, 0x83, 0xf8, 0x80, 0x98 };
char disp[8]={ 2,0,1,1,0,1,2,5 };	//	宣告顯示資料
char i,j;				//	宣告變數i,j
void delay1ms(int);
//=========================================
main()				
{	while(1)			//	while迴圈開始
	{	for(i=0;i<8;i++)//	for敘述開始
		{	j=disp[7-i];//	取出顯示數字
			P2=TAB[j];	//	轉換成驅動信號，並輸出到P2
			P1=i;		//	輸出掃瞄信號
			delay1ms(2);//	延遲2ms
		}				//	結束for敘述
	}					//	結束while敘述
}						//	主程式結束
//=========================================
void delay1ms(int x)
{	int	i,j;
	for(i=0;i<x;i++)
		for(j=0;j<120;j++);
}
//=========================================
